consume-soap-service/src/main/resources/soap-operation-get-company.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddInteger>
         <!--Optional:-->
         <tem:Arg1>5</tem:Arg1>
         <!--Optional:-->
         <tem:Arg2>5</tem:Arg2>
      </tem:AddInteger>
   </soapenv:Body>
</soapenv:Envelope>