src/main/resources/getListByName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetListByName>
            <tem:name>Xavier</tem:name>
        </tem:GetListByName>
    </soapenv:Body>
</soapenv:Envelope>