src/test/resources/soap/requests/divide-integer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
    <soapenv:Header />
    <soapenv:Body>
        <tem:DivideInteger>
            <tem:Arg1>${a}</tem:Arg1>
            <tem:Arg2>${b}</tem:Arg2>
        </tem:DivideInteger>
    </soapenv:Body>
</soapenv:Envelope>