src/main/resources/GetListByName.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetListByName>
         <!--Optional:-->
         <tem:name>Xavier</tem:name>
      </tem:GetListByName>
   </soapenv:Body>
</soapenv:Envelope>