.scannerwork/scanner-report/source-155.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetListByName>
            <!--Optional:-->
            <tem:name>%s</tem:name>
        </tem:GetListByName>
    </soapenv:Body>
</soapenv:Envelope>