allure-results/2652bd84-5ecc-44fc-aa43-51813cd4c3ca-attachment.html

<div>POST to https://www.crcind.com:443/csp/samples/SOAP.Demo.cls</div>

<h4>Body</h4>
<div>
    <pre class="preformated-text">
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;SOAP-ENV:Header/&gt;
  &lt;SOAP-ENV:Body&gt;
    &lt;ns2:FindPerson xmlns:ns2=&quot;http://tempuri.org&quot;&gt;
      &lt;ns2:id&gt;10&lt;/ns2:id&gt;
    &lt;/ns2:FindPerson&gt;
  &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;    </pre>
</div>

<h4>Headers</h4>
<div>
        <div>Accept: */*</div>
        <div>SoapAction: http://tempuri.org/SOAP.Demo.FindPerson</div>
        <div>Content-Type: text/xml; charset=utf-8</div>
</div>



<h4>Curl</h4>
<div>
curl -v -X POST &#39;https://www.crcind.com:443/csp/samples/SOAP.Demo.cls&#39; -H &#39;Accept: */*&#39; -H &#39;SoapAction: http://tempuri.org/SOAP.Demo.FindPerson&#39; -H &#39;Content-Type: text/xml; charset=utf-8&#39; -d &#39;&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;SOAP-ENV:Header/&gt;
  &lt;SOAP-ENV:Body&gt;
    &lt;ns2:FindPerson xmlns:ns2=&quot;http://tempuri.org&quot;&gt;
      &lt;ns2:id&gt;10&lt;/ns2:id&gt;
    &lt;/ns2:FindPerson&gt;
  &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;&#39;
</div>
